import * as Yup from "yup";
export const LOGIN_VALIDATION = Yup.object().shape({
    identifier: Yup.string()
        .email("Невірний формат електронної пошти") // Перевірка формату електронної пошти
        .required("Пошта є обов'язковою"), // Перевірка, що поле не є порожнім
    password: Yup.string()
        .min(8, "Мінімум 8 символів")
        .matches(
            /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]+$/,
            "Пароль повинен містити принаймні одну велику літеру, одну маленьку літеру, одну цифру та один спеціальний символ"
        ),
});
