import * as yup from "yup";
export const REGISTRATION_VALIDATION = yup
    .object({
        email: yup
            .string()
            .email("Введіть дійсну адресу електронної пошти")
            .required("Адреса електронної пошти є обов'язковою"),
        name: yup
            .string()
            .min(2, "Ім'я повинно містити принаймні 2 символи")
            .max(50, "Ім'я повинно бути не більше 50 символів")
            .matches(
                /^[a-zA-Zа-яА-ЯїЇіІєЄґҐ\s']+$/,
                "Ім'я може містити лише літери та пробіли"
            )
            .required("Ім'я є обов'язковим"),
        lastName: yup
            .string()
            .min(2, "Фамілія повинна містити принаймні 2 символи")
            .max(20, "Фамілія повинна бути не більше 20 символів")
            .matches(
                /^[a-zA-Zа-яА-ЯїЇіІєЄґҐ\s']+$/,
                "Фамілія може містити лише літери та пробіли"
            )
            .required("Фамілія є обов'язковою"),

        birthDay: yup.string().required("Дата народження є обов'язковою"),
        street: yup
            .string()
            .min(2, "Вулиця повинна містити принаймні 2 символи")
            .max(30, "Вулиця повинна бути не більше 30 символів")
            .required("Вулиця є обов'язковою"),
        password: yup
            .string()
            .min(8, "Пароль повинен містити принаймні 8 символів")
            .matches(
                /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]+$/,
                "Пароль повинен містити принаймні одну велику літеру, одну маленьку літеру, одну цифру та один спеціальний символ"
            )
            .required("Пароль є обов'язковим полем"),
        confirmPassword: yup
            .string()
            .oneOf([yup.ref("password"), ""], "Паролі повинні співпадати")
            .required('Поле "Повторити пароль" є обов\'язковим'),
        username: yup
            .string()
            .required("Введіть Логін користувача")
            .min(4, "Логін користувача має містити щонайменше 4 символи")
            .max(20, "Логін користувача має містити не більше 20 символів")
            .matches(
                /^[a-zA-Z0-9_-]+$/,
                "Логін користувача може містити лише літери, цифри, дефіси та підкреслення"
            ),
    })
    .required();
export const USER_CHANGE_PROFILE_VALIDATION = yup
    .object({
        email: yup
            .string()
            .email("Введіть дійсну адресу електронної пошти")
            .required("Адреса електронної пошти є обов'язковою"),
        name: yup
            .string()
            .min(2, "Ім'я повинно містити принаймні 2 символи")
            .max(50, "Ім'я повинно бути не більше 50 символів")
            .matches(
                /^[a-zA-Zа-яА-ЯїЇіІєЄґҐ\s']+$/,
                "Ім'я може містити лише літери та пробіли"
            )
            .required("Ім'я є обов'язковим"),
        lastName: yup
            .string()
            .min(2, "Фамілія повинна містити принаймні 2 символи")
            .max(20, "Фамілія повинна бути не більше 20 символів")
            .matches(
                /^[a-zA-Zа-яА-ЯїЇіІєЄґҐ\s']+$/,
                "Фамілія може містити лише літери та пробіли"
            )
            .required("Фамілія є обов'язковою"),

        birthDay: yup.string().required("Дата народження є обов'язковою"),

        username: yup
            .string()
            .required("Введіть Логін користувача")
            .min(4, "Логін користувача має містити щонайменше 4 символи")
            .max(20, "Логін користувача має містити не більше 20 символів")
            .matches(
                /^[a-zA-Z0-9_-]+$/,
                "Логін користувача може містити лише літери, цифри, дефіси та підкреслення"
            ),
    })
    .required();
