import { FC, useState } from "react";
import Button from "../../uikit/buttons/Button.js";

type SubscribeForDiscountType = {};

const SubscribeForDiscount: FC<SubscribeForDiscountType> = () => {
    const [isSubscribe, setSubscribeStatus] = useState(false);
    const handlerToggleSubscribeAlert = () => {
        setSubscribeStatus((prev) => !prev);
    };

    return (
        <div className="center">
            <Button
                variant="primary"
                filledType="empty"
                size="mini"
                className="group"
                onClick={handlerToggleSubscribeAlert}
                leftElem={
                    isSubscribe ? (
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                            className=" group-hover:fill-orange duration-200 fill-myGrey"
                        >
                            <path
                                fillRule="evenodd"
                                clipRule="evenodd"
                                d="M15.2778 3.3842C13.2821 2.21815 10.8173 2.19959 8.80431 3.33546C8.56381 3.47116 8.25884 3.38621 8.12313 3.14572C7.98743 2.90522 8.07238 2.60025 8.31288 2.46454C10.6356 1.15392 13.4796 1.17534 15.7823 2.52079C18.085 3.86623 19.5 6.3333 19.4986 9.00026L18.9986 9H19.4986V9.00026V13C19.4986 13.2761 19.2747 13.5 18.9986 13.5C18.7225 13.5 18.4986 13.2761 18.4986 13V9L18.4986 8.99975C18.4998 6.68838 17.2734 4.55026 15.2778 3.3842ZM6.00937 5.33572C6.25474 5.46239 6.35096 5.764 6.22429 6.00937C5.74707 6.93372 5.49869 7.95911 5.5 8.99937L5.5 9L5.5 14C5.5 14.9793 5.09777 15.8647 4.44949 16.5H17C17.2761 16.5 17.5 16.7239 17.5 17C17.5 17.2761 17.2761 17.5 17 17.5H2C1.72386 17.5 1.5 17.2761 1.5 17C1.5 16.7239 1.72386 16.5 2 16.5C3.38071 16.5 4.5 15.3807 4.5 14V9.00025M10.0191 20.5675C10.258 20.4289 10.5639 20.5103 10.7025 20.7491C10.9708 21.2117 11.4652 21.4965 12 21.4965C12.5348 21.4965 13.0292 21.2117 13.2975 20.7491C13.4361 20.5103 13.742 20.4289 13.9809 20.5675C14.2197 20.7061 14.3011 21.012 14.1625 21.2509C13.7153 22.0219 12.8913 22.4965 12 22.4965C11.1087 22.4965 10.2847 22.0219 9.8375 21.2509C9.69894 21.012 9.78025 20.7061 10.0191 20.5675Z"
                            />
                            <path
                                fillRule="evenodd"
                                clipRule="evenodd"
                                d="M0.646447 0.646447C0.841709 0.451184 1.15829 0.451184 1.35355 0.646447L23.3536 22.6464C23.5488 22.8417 23.5488 23.1583 23.3536 23.3536C23.1583 23.5488 22.8417 23.5488 22.6464 23.3536L0.646447 1.35355C0.451184 1.15829 0.451184 0.841709 0.646447 0.646447Z"
                            />
                        </svg>
                    ) : (
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                            className=" group-hover:fill-orange duration-200 fill-myGrey"
                        >
                            <path
                                fillRule="evenodd"
                                clipRule="evenodd"
                                d="M12 2.5C8.41015 2.5 5.5 5.41015 5.5 9V14C5.5 14.9793 5.09777 15.8647 4.44949 16.5H19.5505C18.9022 15.8647 18.5 14.9793 18.5 14V9C18.5 5.41015 15.5899 2.5 12 2.5ZM22 16.5C20.6193 16.5 19.5 15.3807 19.5 14V9C19.5 4.85786 16.1421 1.5 12 1.5C7.85786 1.5 4.5 4.85786 4.5 9V14C4.5 15.3807 3.38071 16.5 2 16.5C1.72386 16.5 1.5 16.7239 1.5 17C1.5 17.2761 1.72386 17.5 2 17.5H22V16.5ZM9.83673 20.7504C9.92598 20.5955 10.0912 20.5 10.27 20.5H13.73C13.9088 20.5 14.074 20.5955 14.1633 20.7504C14.2525 20.9054 14.2522 21.0962 14.1625 21.2509C13.7153 22.0219 12.8913 22.4965 12 22.4965C11.1087 22.4965 10.2847 22.0219 9.8375 21.2509C9.74778 21.0962 9.74748 20.9054 9.83673 20.7504Z"
                            />
                        </svg>
                    )
                }
            >
                <span className="text-[12px] px-[6px] group-hover:text-orange duration-200">
                    {isSubscribe
                        ? "ВІдписатися від повідомлень"
                        : "Повідомити про зниження ціни"}
                </span>
            </Button>
        </div>
    );
};

export default SubscribeForDiscount;
